; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v4 ?v11)
             (pred_10 ?v1 ?v6)
             (pred_9 ?v4 ?v6)
             (pred_6 ?v5 ?v4 )
	     (pred_4 ?v4)
             (pred_2 ?v9)
             (pred_5 ?v1)
             (pred_3 ?v6)
             (pred_1 ?v4)
             (pred_11 ?v1)
             (pred_12 ?v4)
             (pred_8 ))



(:action op_2
:parameters (?v3 ?v10 ?v8 ?v7)
:precondition (and (pred_2 ?v3) (pred_2 ?v10) (pred_5 ?v8) (pred_3 ?v7)
          (pred_7 ?v3 ?v10) (pred_10 ?v8 ?v7)
                   (pred_9 ?v10 ?v7) (pred_4 ?v3) 
                   (pred_1 ?v10) (pred_11 ?v8))
:effect (and  (pred_12 ?v10) (not (pred_1 ?v10))))


(:action op_5
:parameters (?v3 ?v12)
:precondition (and (pred_2 ?v3) (pred_2 ?v12)
               (pred_4 ?v3) (pred_7 ?v3 ?v12) (pred_12 ?v12))
:effect (and (pred_4 ?v12) (not (pred_4 ?v3))))

(:action op_1
:parameters (?v3 ?v8)
:precondition (and (pred_2 ?v3) (pred_5 ?v8) 
                  (pred_4 ?v3) (pred_6 ?v8 ?v3) (pred_8 ))
:effect (and (pred_11 ?v8)
   (not (pred_6 ?v8 ?v3)) (not (pred_8 ))))


(:action op_3
:parameters (?v3 ?v13 ?v2)
:precondition (and (pred_2 ?v3) (pred_5 ?v13) (pred_5 ?v2)
                  (pred_4 ?v3) (pred_11 ?v2) (pred_6 ?v13 ?v3))
:effect (and (pred_11 ?v13) (pred_6 ?v2 ?v3)
        (not (pred_11 ?v2)) (not (pred_6 ?v13 ?v3))))

(:action op_4
:parameters (?v3 ?v8)
:precondition (and (pred_2 ?v3) (pred_5 ?v8) 
                  (pred_4 ?v3) (pred_11 ?v8))
:effect (and (pred_8 ) (pred_6 ?v8 ?v3) (not (pred_11 ?v8)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_16 obj_06 obj_28 obj_26 obj_29 obj_11 obj_03 obj_25 obj_27 obj_14 obj_30 obj_24 obj_19 obj_23 obj_09 obj_08 obj_20 obj_04 obj_02 obj_18 obj_10 obj_12 obj_22 obj_21
    obj_13 obj_07
    obj_15 obj_05 obj_17
    )

    (:init
       (pred_8)

       (pred_2 obj_01)
       (pred_2 obj_16)
       (pred_2 obj_06)
       (pred_2 obj_28)
       (pred_2 obj_26)
       (pred_2 obj_29)
       (pred_2 obj_11)
       (pred_2 obj_03)
       (pred_2 obj_25)
       (pred_2 obj_27)
       (pred_2 obj_14)
       (pred_2 obj_30)
       (pred_2 obj_24)
       (pred_2 obj_19)
       (pred_2 obj_23)
       (pred_2 obj_09)
       (pred_2 obj_08)
       (pred_2 obj_20)
       (pred_2 obj_04)
       (pred_2 obj_02)
       (pred_2 obj_18)
       (pred_2 obj_10)
       (pred_2 obj_12)
       (pred_2 obj_22)
       (pred_2 obj_21)
       (pred_3 obj_13)
       (pred_3 obj_07)
       (pred_5 obj_15)
       (pred_5 obj_05)
       (pred_5 obj_17)

       (pred_7 obj_01 obj_29)
       (pred_7 obj_01 obj_16)
       (pred_7 obj_16 obj_11)
       (pred_7 obj_16 obj_06)
       (pred_7 obj_16 obj_01)
       (pred_7 obj_06 obj_03)
       (pred_7 obj_06 obj_28)
       (pred_7 obj_06 obj_16)
       (pred_7 obj_28 obj_25)
       (pred_7 obj_28 obj_26)
       (pred_7 obj_28 obj_06)
       (pred_7 obj_26 obj_27)
       (pred_7 obj_26 obj_28)
       (pred_7 obj_29 obj_14)
       (pred_7 obj_29 obj_11)
       (pred_7 obj_29 obj_01)
       (pred_7 obj_11 obj_30)
       (pred_7 obj_11 obj_03)
       (pred_7 obj_11 obj_16)
       (pred_7 obj_11 obj_29)
       (pred_7 obj_03 obj_24)
       (pred_7 obj_03 obj_25)
       (pred_7 obj_03 obj_06)
       (pred_7 obj_03 obj_11)
       (pred_7 obj_25 obj_19)
       (pred_7 obj_25 obj_27)
       (pred_7 obj_25 obj_28)
       (pred_7 obj_25 obj_03)
       (pred_7 obj_27 obj_23)
       (pred_7 obj_27 obj_26)
       (pred_7 obj_27 obj_25)
       (pred_7 obj_14 obj_09)
       (pred_7 obj_14 obj_30)
       (pred_7 obj_14 obj_29)
       (pred_7 obj_30 obj_08)
       (pred_7 obj_30 obj_24)
       (pred_7 obj_30 obj_11)
       (pred_7 obj_30 obj_14)
       (pred_7 obj_24 obj_20)
       (pred_7 obj_24 obj_19)
       (pred_7 obj_24 obj_03)
       (pred_7 obj_24 obj_30)
       (pred_7 obj_19 obj_04)
       (pred_7 obj_19 obj_23)
       (pred_7 obj_19 obj_25)
       (pred_7 obj_19 obj_24)
       (pred_7 obj_23 obj_02)
       (pred_7 obj_23 obj_27)
       (pred_7 obj_23 obj_19)
       (pred_7 obj_09 obj_18)
       (pred_7 obj_09 obj_08)
       (pred_7 obj_09 obj_14)
       (pred_7 obj_08 obj_10)
       (pred_7 obj_08 obj_20)
       (pred_7 obj_08 obj_30)
       (pred_7 obj_08 obj_09)
       (pred_7 obj_20 obj_12)
       (pred_7 obj_20 obj_04)
       (pred_7 obj_20 obj_24)
       (pred_7 obj_20 obj_08)
       (pred_7 obj_04 obj_22)
       (pred_7 obj_04 obj_02)
       (pred_7 obj_04 obj_19)
       (pred_7 obj_04 obj_20)
       (pred_7 obj_02 obj_21)
       (pred_7 obj_02 obj_23)
       (pred_7 obj_02 obj_04)
       (pred_7 obj_18 obj_10)
       (pred_7 obj_18 obj_09)
       (pred_7 obj_10 obj_12)
       (pred_7 obj_10 obj_08)
       (pred_7 obj_10 obj_18)
       (pred_7 obj_12 obj_22)
       (pred_7 obj_12 obj_20)
       (pred_7 obj_12 obj_10)
       (pred_7 obj_22 obj_21)
       (pred_7 obj_22 obj_04)
       (pred_7 obj_22 obj_12)
       (pred_7 obj_21 obj_02)
       (pred_7 obj_21 obj_22)
       (pred_1 obj_25)
       (pred_1 obj_11)
       (pred_1 obj_22)
       (pred_9  obj_25 obj_13)
       (pred_9  obj_11 obj_07)
       (pred_9  obj_22 obj_07)
       (pred_12 obj_01)
       (pred_12 obj_16)
       (pred_12 obj_06)
       (pred_12 obj_28)
       (pred_12 obj_26)
       (pred_12 obj_29)
       (pred_12 obj_03)
       (pred_12 obj_27)
       (pred_12 obj_14)
       (pred_12 obj_30)
       (pred_12 obj_24)
       (pred_12 obj_19)
       (pred_12 obj_23)
       (pred_12 obj_09)
       (pred_12 obj_08)
       (pred_12 obj_20)
       (pred_12 obj_04)
       (pred_12 obj_02)
       (pred_12 obj_18)
       (pred_12 obj_10)
       (pred_12 obj_12)
       (pred_12 obj_21)

       (pred_10  obj_15 obj_13)
       (pred_10  obj_05 obj_07)
       (pred_10  obj_17 obj_07)
       (pred_6 obj_15 obj_21)
       (pred_6 obj_05 obj_23)
       (pred_6 obj_17 obj_21)
       (pred_4 obj_30)
    )

    (:goal (and
       (pred_6 obj_15 obj_27)
       (pred_6 obj_05 obj_30)
       (pred_6 obj_17 obj_11)
    ))
(:constraints
  (always (not (pred_4 obj_19)))
)
)

; plan
1. (op_5 obj_30 obj_24)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_24)
   goals met: 0 of 3
2. (op_5 obj_24 obj_20)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_20)
   goals met: 0 of 3
3. (op_5 obj_20 obj_04)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_04)
   goals met: 0 of 3
4. (op_5 obj_04 obj_02)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_02)
   goals met: 0 of 3
5. (op_5 obj_02 obj_21)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_21)
   goals met: 0 of 3
6. (op_1 obj_21 obj_17)
   deleted: (pred_6 obj_17 obj_21) (pred_8)
   added: (pred_11 obj_17)
   goals met: 0 of 3
7. (op_5 obj_21 obj_02)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_02)
   goals met: 0 of 3
8. (op_4 obj_02 obj_17)
   deleted: (pred_11 obj_17)
   added: (pred_8) (pred_6 obj_17 obj_02)
   goals met: 0 of 3
9. (op_5 obj_02 obj_21)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_21)
   goals met: 0 of 3
10. (op_1 obj_21 obj_15)
   deleted: (pred_6 obj_15 obj_21) (pred_8)
   added: (pred_11 obj_15)
   goals met: 0 of 3
11. (op_5 obj_21 obj_02)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_02)
   goals met: 0 of 3
12. (op_5 obj_02 obj_23)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_23)
   goals met: 0 of 3
13. (op_5 obj_23 obj_27)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_27)
   goals met: 0 of 3
14. (op_2 obj_27 obj_25 obj_15 obj_13)
   deleted: (pred_1 obj_25)
   added: (pred_12 obj_25)
   goals met: 0 of 3
15. (op_4 obj_27 obj_15)
   deleted: (pred_11 obj_15)
   added: (pred_8) (pred_6 obj_15 obj_27)
   goals met: 1 of 3
16. (op_5 obj_27 obj_23)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_23)
   goals met: 1 of 3
17. (op_1 obj_23 obj_05)
   deleted: (pred_6 obj_05 obj_23) (pred_8)
   added: (pred_11 obj_05)
   goals met: 1 of 3
18. (op_5 obj_23 obj_02)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_02)
   goals met: 1 of 3
19. (op_5 obj_02 obj_04)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_04)
   goals met: 1 of 3
20. (op_5 obj_04 obj_20)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_20)
   goals met: 1 of 3
21. (op_5 obj_20 obj_08)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_08)
   goals met: 1 of 3
22. (op_5 obj_08 obj_30)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_30)
   goals met: 1 of 3
23. (op_2 obj_30 obj_11 obj_05 obj_07)
   deleted: (pred_1 obj_11)
   added: (pred_12 obj_11)
   goals met: 1 of 3
24. (op_4 obj_30 obj_05)
   deleted: (pred_11 obj_05)
   added: (pred_8) (pred_6 obj_05 obj_30)
   goals met: 2 of 3
25. (op_5 obj_30 obj_08)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_08)
   goals met: 2 of 3
26. (op_5 obj_08 obj_20)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_20)
   goals met: 2 of 3
27. (op_5 obj_20 obj_04)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_04)
   goals met: 2 of 3
28. (op_5 obj_04 obj_02)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_02)
   goals met: 2 of 3
29. (op_1 obj_02 obj_17)
   deleted: (pred_6 obj_17 obj_02) (pred_8)
   added: (pred_11 obj_17)
   goals met: 2 of 3
30. (op_5 obj_02 obj_23)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_23)
   goals met: 2 of 3
31. (op_5 obj_23 obj_27)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_27)
   goals met: 2 of 3
32. (op_5 obj_27 obj_25)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_25)
   goals met: 2 of 3
33. (op_5 obj_25 obj_03)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_03)
   goals met: 2 of 3
34. (op_5 obj_03 obj_11)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_11)
   goals met: 2 of 3
35. (op_4 obj_11 obj_17)
   deleted: (pred_11 obj_17)
   added: (pred_8) (pred_6 obj_17 obj_11)
   goals met: 3 of 3
